snlkuharlocal/src/DataProcessors/ПечатьСпецификаций/ПечатьСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьСпецификаций</name>
  <attributes>
    <name>Док</name>
    <type>
      <types>DocumentRef.КонтрактСПроизводителем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentObject.ВводОстатковТМЦ</types>
      <types>DocumentObject.Чек</types>
      <types>DocumentObject.ОприходованиеТМЦ</types>
      <types>DocumentObject.РасходнаяНакладная</types>
      <types>DocumentObject.ЛистНабора</types>
      <types>DocumentObject.Инвентаризация</types>
      <types>DocumentObject.ВиртуальныйРезерв</types>
      <types>DocumentObject.КонтрактСПроизводителем</types>
      <types>DocumentObject.ПриходнаяНакладная</types>
      <types>DocumentObject.Перемещение</types>
      <types>DocumentObject.ЗаказПоставщику</types>
      <types>DocumentObject.СписаниеТМЦ</types>
      <types>DocumentObject.РекламационнаяНакладная</types>
      <types>DocumentObject.ОтчетКассовойСмены</types>
      <types>DocumentObject.ЛистПереукладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <comment>Левый-Правый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПропускаемыхСекций</name>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ПечатьСпецификаций/ObjectModule.bsl
Перем ИмяСекцииКонца;

Функция ПечатьПакетная(ДопПараметры=Неопределено) Экспорт
	
	НачалоВыполнения=ОценкаПроизводительности.НачатьЗамерВремени();
	
	Если ДопПараметры=Неопределено Тогда
		Режим						=Истина;	
		ВыбСписокПропускаемыхСекций	=Неопределено;
		ПечатьТК					=Ложь;
	Иначе		
		РежимВПар		=Неопределено;
		Если ДопПараметры.Свойство("Режим",РежимВПар) Тогда
			Режим		=РежимВПар;		
		КонецЕсли; 
		ВыбСписокПропускаемыхСекцийПар=Неопределено;
		Если ДопПараметры.Свойство("ВыбСписокПропускаемыхСекций",ВыбСписокПропускаемыхСекцийПар) Тогда
			ВыбСписокПропускаемыхСекций=ВыбСписокПропускаемыхСекцийПар;		
		КонецЕсли;		
		ПечатьТКПар=Неопределено;
		Если ДопПараметры.Свойство("ПечатьТК",ПечатьТКПар) Тогда
			ПечатьТК=ПечатьТКПар;		
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипЗнч(ВыбСписокПропускаемыхСекций)=Тип("Структура") Тогда
		СписокПропускаемыхСекций=ВыбСписокПропускаемыхСекций;	
	КонецЕсли;
	
	ТабДокумент = СформироватьСпецификациюСервер();
	ОценкаПроизводительности.ЗакончитьЗамерВремени("Печать.Спецификация",НачалоВыполнения);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьСпецификациюСервер() Экспорт
	Перем Таб;
	
	НаборщикСканировщик="";
	
	Если ДокОбъект=Неопределено Тогда Возврат Неопределено КонецЕсли; 
	
	МетаДок=ДокОбъект.Метаданные();
	ТекВид=МетаДок.Имя;		     
	
	Если ТекВид="ПриходнаяНакладная" Тогда
		ИмяСекцииКонца=?(ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен"),"Конец","КонецБезЦен");
	ИначеЕсли ТекВид="Перемещение" Тогда                                                
		// Кухарь А.Ю.  20.06.2022 начало
		// 		ИмяСекцииКонца="Конец";	
		если ЗначениеЗаполнено(ДокОбъект.ДокОснование) и ТипЗнч(ДокОбъект.ДокОснование)=Тип("ДокументСсылка.РасходнаяНакладная") и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
			ИмяСекцииКонца="КонецБезЦен";
		иначе
			ИмяСекцииКонца="Конец";
		КонецЕсли;	
		// Кухарь А.Ю.  20.06.2022 конец 	 
	ИначеЕсли ТекВид="ЛистНабора" Тогда  	
		ИмяСекцииКонца="КонецБезЦен";
		НаборщикСканировщик=""+ДокОбъект.Наборщик.Код+","+ДокОбъект.Сканировщик.Код; 
		//++Данилова Е.В. 13.02.2026 SNL-139
	ИначеЕсли ТекВид="ЛистПереукладки" Тогда 
		//--Данилова Е.В. 13.02.2026 
		ИмяСекцииКонца="КонецБезЦен";
		НаборщикСканировщик= ДокОбъект.Сканировщик.Код; 
		//--Данилова Е.В. 13.02.2026 
	Иначе
		ИмяСекцииКонца="Конец";
	КонецЕсли;
	
	Если ПланыОбмена.Основной.ЭтотУзел().ПечатьСпецификацийБезЦен Тогда
		ИмяСекцииКонца="КонецБезЦен";		
	КонецЕсли;
	
	ПараметрыШапки=Новый Структура;
	
	ПараметрыШапки.Вставить("Заголовок","Спецификация к документу: "+МетаДок+" № "+ДокОбъект.Номер+" от "+ДокОбъект.Дата);		
	
	Если ЕстьРеквизитДокумента("Контрагент",МетаДок) Тогда
		ПараметрыШапки.Вставить("Получатель","Клиент: "+?(Режим,ДокОбъект.Контрагент.Наименование,ДокОбъект.ЛевыйКонтрагент.Наименование));
		ПараметрыШапки.Вставить("ФактАдрес","Факт. адрес: "+ДокОбъект.Контрагент.ПочтовыйАдрес);
	ИначеЕсли ЕстьРеквизитДокумента("СкладПолучатель",МетаДок) Тогда
		ПараметрыШапки.Вставить("Получатель","Получатель: "+ДокОбъект.СкладПолучатель);		
	КонецЕсли;	
	Если ЕстьРеквизитДокумента("ПунктДоставки",МетаДок) И Режим Тогда
		Если ЗначениеЗаполнено(ДокОбъект.ПунктДоставки) Тогда
			ПараметрыШапки.Вставить("ФактАдрес","Факт. адрес: "+ДокОбъект.ПунктДоставки+" ("+ДокОбъект.ПунктДоставки.ПочтовыйАдрес+")");		
		КонецЕсли;		
	КонецЕсли;
	
	ПараметрыШапки.Вставить("Склад","Склад: "+ДокОбъект.Склад.Наименование);		
	ПараметрыШапки.Вставить("Основание",ДокОбъект.Комментарий);
	//крохин начало 20.04.2012
	Если ТекВид = "РасходнаяНакладная" Тогда
		ПараметрыШапки.Вставить("Договор","Договор: "+ДокОбъект.Договор.Наименование);
	Иначе
		ПараметрыШапки.Вставить("Договор","");
	КонецЕсли;
	//крохин конец 20.04.2012
	Если (ТекВид="СписаниеТМЦ") ИЛИ (ТекВид="ОприходованиеТМЦ")тогда
		//++Данилова Е.В. 13.02.2026 SNL-139 	
	ИначеЕсли (ТекВид="ЛистНабора") 
		ИЛИ ТекВид="ЛистПереукладки" Тогда 
		//--Данилова Е.В. 13.02.2026 
		// Кухарь А.Ю.  23.11.2022 начало
		// 		Валюта		=ДокОбъект.ДокОснование.Валюта;
		если ЕстьРеквизитДокумента("Валюта",ДокОбъект.метаданные()) тогда
			Валюта		=ДокОбъект.ДокОснование.Валюта;		 
			Курс		=ДокОбъект.ДокОснование.Курс;
		иначе
			валюта=Константы.ВалютаУпрУчета.Получить();
			Курс		= 1;
		КонецЕсли;
		// Кухарь А.Ю.  23.11.2022 конец

	Иначе
		Валюта		=ДокОбъект.Валюта;
		Курс		=ДокОбъект.Курс;
	КонецЕсли;	
	
	ПараметрыШапки.Вставить("ВалютаКурс","Валюта: "	+Валюта); 
	ПараметрыШапки.Вставить("ЗаголовокСуммы","Сумма,"	+Валюта);	
	
	
	ТД=ДокОбъект.Товары.Выгрузить();
	
	//в перемещениях на складе печатается по колонке "Отгружено"
	Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение И ТекВид="Перемещение" И ДокОбъект.СкладПолучатель.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код Тогда
		Для Каждого СтрокаТД Из ТД Цикл
			СтрокаТД.Количество=СтрокаТД.ПодтвержденнаяЗаявка;		
		КонецЦикла; 	
	КонецЕсли; 
	
	// Кухарь А.Ю. 30.10.2020 начало
	// Удалим нули из спецификации
	МассНулей=тд.найтистроки(новый Структура("Количество",0));
	Для каждого СтрМассНулей из МассНулей цикл
		ТД.удалить(ТД.индекс(СтрМассНулей));
	КонецЦикла; 
	// Кухарь А.Ю. 30.10.2020 конец
	
	СВ=РассчитатьСпецификацию(ТД);
	Если СВ=ЛОЖЬ тогда //Мессерле
		возврат(ложь);
	Конецесли;	
	
	ТР					=СВ["ТР"];
	ТД					=СВ["ТД"];	
	МаксЧислоРазмеров	=СВ["МаксЧислоРазмеров"];
	
	ТранспортнаяКомпания="";		
	Если ПечатьТК Тогда	    
		Попытка
			ТранспортнаяКомпания=ДокОбъект.ПунктДоставки.ТранспортнаяКомпания;
			ТранспортнаяКомпания=	"Трансп. компания: "+СокрЛП(ТранспортнаяКомпания)+","+Символы.ПС+
			"адрес: "+СокрЛП(ТранспортнаяКомпания.Адрес)+", тел.: "+СокрЛП(ТранспортнаяКомпания.Телефоны)+","+Символы.ПС+
			"дата отгрузки: "+ДокОбъект.ДатаОтгрузки;
			
			ПараметрыШапки.Вставить("ТранспортнаяКомпания",ТранспортнаяКомпания);
		Исключение			
		КонецПопытки;
	КонецЕсли;
	
	Если ТекВид="РасходнаяНакладная" Тогда
		Если НЕ ДокОбъект.ПунктДоставки.Пустая() И НЕ ДокОбъект.ПунктДоставки.РайонДоставки.Пустая() Тогда
			ПараметрыШапки.Вставить("РайонДоставки","Район доставки: "+ДокОбъект.ПунктДоставки.РайонДоставки+".Сектор: "+ДокОбъект.ПунктДоставки.РайонДоставки.Сектор);		
		ИначеЕсли НЕ ДокОбъект.Контрагент.РайонДоставки.Пустая() Тогда
			ПараметрыШапки.Вставить("РайонДоставки","Район доставки: "+ДокОбъект.Контрагент.РайонДоставки+".Сектор: "+ДокОбъект.Контрагент.РайонДоставки.Сектор);
		КонецЕсли;
		//крохин начало
		//для Волгограда
		//ИначеЕсли НЕ ДокОбъект.ПунктДоставки.Пустая( 
		//крохин конец
	КонецЕсли; 
	//крохин начало
	//для РНК пишем дату оплаты, по требованию Порохнявого
	Если ТекВид="РасходнаяНакладная" И ДокОбъект.ДатаОплаты <>  '00010101000000' Тогда
		ПараметрыШапки.Вставить("Оплата","Дата оплаты: "+Формат(ДокОбъект.ДатаОплаты,"ДФ=dd.MM.yyyy") + ". Датой оплаты является дата зачисления денежных средств в кассу или на р/с поставщика");
	иначе
		ПараметрыШапки.Вставить("Оплата","");
	КонецЕсли;
	//выводим дату отгрузки, по требованию Червякова
	попытка
		ПараметрыШапки.Вставить("Датаотгрузки","ДатаОтгрузки: "+Формат(ДокОбъект.ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
	исключение
		//	сообщить(ОписаниеОшибки());
	конецпопытки  ;
	//крохин конец
	// Подготовка к заполнению выходных форм данными запроса
	Таб 	= Новый ТабличныйДокумент;	
	Таб.ИмяПараметровПечати			="ПараметрыПечати_Спецификация";
	Таб.ИмяСохраненияПоложенияОкна  ="РазмерОкна_Спецификация";
	
	Таб.ОтображатьСетку=Ложь;
	Таб.ОтображатьЗаголовки=Ложь;
	
	Макет	= ПолучитьМакет("Спецификация");	
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Начало");
	ОблЗаголовок.Параметры.Заполнить(ПараметрыШапки);
	
	Таб.Вывести(ОблЗаголовок);
	Для Сч=1 по МаксЧислоРазмеров Цикл
		Таб.Присоединить(Макет.ПолучитьОбласть("Заголовок|Размер"));	    
	КонецЦикла;
	ОблКонец=Макет.ПолучитьОбласть("Заголовок|"+ИмяСекцииКонца);
	ОблКонец.Параметры.Заполнить(ПараметрыШапки);	
	//Кухарь 27.12.2018 начало
	//В ПНК пишут номер машины в комментарии
	если ТекВид="ЛистНабора" и ДокОбъект.ДокОснование.Метаданные().Имя="ПриходнаяНакладная" и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
		ОблКонец.Параметры.Комментарий=СтрЗаменить(Лев(ДокОбъект.ДокОснование.Комментарий,4),"_","");
		ОблКонец.Область("Комментарий").ЦветФона=ЦветаСтиля.ЖелтыйЦвет;
	КонецЕсли;
	//Кухарь 27.12.2018 конец	
	//Кухарь 20.03.18 начало
	//ШК накладной
	Для Каждого Рисунок Из ОблКонец.Рисунки Цикл	
		ШтрихКод=Формат(ТекущаяДата(),"ДФ=yyMMdd")+Прав(ДокОбъект.Номер,6);
		ШтрихКод=ШтрихКод+КонтрольныйСимволEAN(ШтрихКод,13);
		Если Рисунок.Имя="ОбъектШК" или Рисунок.Имя="ОбъектШК1" Тогда
			если ДокОбъект.Метаданные().Имя="ПриходнаяНакладная" тогда
				ОбъектШК			=Рисунок.Объект;
				ОбъектШК.Сообщение	=ШтрихКод;
			иначе ОблКонец.Рисунки.Удалить(Рисунок);
			КонецЕсли;						
		КонецЕсли;
	КонецЦикла;
	//Кухарь 20.03.18 конец	
	
	//Кухарь 12.02.19 начало
	//Грузчики печатают отдельную спецификацию и хотят иметь на ней ШК для поиска по нему накладной	
	Для Каждого Рисунок Из ОблКонец.Рисунки Цикл	
		Если Рисунок.Имя="ШКПланаНабора" и ПараметрыСеанса.ТипУзла= Перечисления.ТипУзлаИБ.Склад тогда
			ТекДок=ДокОбъект.ссылка;
			КодИсх="*"+ТекДок.Метаданные().Синоним+"*"+ТекДок.Номер+"*"+Прав(""+Год(ТекДок.Дата),2)+"**"+1;
			ОбъектШК			=Рисунок.Объект;
			ОбъектШК.Сообщение = ЗаполнениеДокументов.Закодировать64Сервер(КодИсх);
		иначе ОблКонец.Рисунки.Удалить(Рисунок);
		КонецЕсли;
	КонецЦикла;
	//Кухарь 12.02.19 конец
	
	Таб.Присоединить(ОблКонец);
	
	Если ТекВид="РасходнаяНакладная" И ДокОбъект.ДопОбработка>0 Тогда
		Таб.Вывести(Макет.ПолучитьОбласть("ЗаголовокДопОбработка|Начало"));
		Для Каждого СтрокаТЧ Из ДокОбъект.ДопОбработки Цикл
			Если СтрокаТЧ.ВидДопОбработки=Справочники.ВидыДопОбработки.БезОбработки Тогда Продолжить КонецЕсли; 
			
			ОблСтрока=Макет.ПолучитьОбласть("СтрокаДопОбработки|Начало");		
			ОблСтрока.Параметры.Заполнить(СтрокаТЧ.ВидДопОбработки);
			ОблСтрока.Параметры.Заполнить(СтрокаТЧ);
			
			Таб.Вывести(ОблСтрока);			
		КонецЦикла;	
	КонецЕсли; 
	
	//Пропись(Валюта.ИмяФайлаПрописи);
	ВывестиТаблицуСпецификации(Таб,ТР,ТД,МаксЧислоРазмеров,Валюта);
	
	ЗаполнениеДокументов.ВывестиКонтрольнуюИнформациюВВыходнуюТаблицуСервер(ДокОбъект,Таб,ПолучитьМакет("Спецификация"));
	
	//Кухарь 27.12.2018 начало
	//В ПНК пишут номер машины в комментарии
	если ТекВид="ЛистНабора" и ДокОбъект.ДокОснование.Метаданные().Имя="ПриходнаяНакладная" и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад и ДокОбъект.Товары.Количество()=1 тогда
		// Кухарь А.Ю. 12.10.2020 начало
	// решили что номенклатуру крупно будут печатать на отдельной странице.
	  таб.ВывестиГоризонтальныйРазделительСтраниц();

	// Кухарь А.Ю. 12.10.2020 конец
	
		ОблНоменклатураКрупно=Макет.ПолучитьОбласть("НоменклатураКрупно");
		Номенклатура=ДокОбъект.товары.Получить(0).Номенклатура;
		ТекМодель=Номенклатура.Родитель.Наименование;
		Скобка=Найти(ТекМодель,"(");
		если Скобка>0 тогда
			ТекМодель=Лев(ТекМодель,Скобка-1);
		КонецЕсли;
		
		ТекРазмер=Номенклатура.Размер.Наименование;
		Скобка=Найти(ТекРазмер,"(");
		если Скобка>0 тогда
			ТекРазмер=Лев(ТекРазмер,Скобка-1);
		КонецЕсли;
		
		ОблНоменклатураКрупно.Параметры.модель=ТекМодель;
		ОблНоменклатураКрупно.Параметры.Цвет=Номенклатура.Цвет;
		ОблНоменклатураКрупно.Параметры.размер=ТекРазмер;
		// Кухарь А.Ю. 09.10.2020 начало
		//  		Область=ОблНоменклатураКрупно.Область(1,1,1,таб.ШиринаТаблицы-1);	
		Область=ОблНоменклатураКрупно.Область(1,1,1,Макс(таб.ШиринаТаблицы-1,14));
		
		// Кухарь А.Ю. 09.10.2020 конец
		
		Область.Объединить();
		// Кухарь А.Ю. 09.10.2020 начало
		//Область=ОблНоменклатураКрупно.Область(2,1,2,таб.ШиринаТаблицы-1);
		Область=ОблНоменклатураКрупно.Область(2,1,2,Макс(таб.ШиринаТаблицы-1,14));		 
		// Кухарь А.Ю. 09.10.2020 конец
		
		Область.Объединить();		
		Таб.Вывести(ОблНоменклатураКрупно);
	КонецЕсли;
	//Кухарь 27.12.2018 конец		
	
	ЗаполнениеДокументов.УстановитьКолонтитулыСервер(Таб);
	//крохин начало
	//Катаев+ 31/10/13 Добавил документ
	ЗаписатьВЛог("Печать Документов","Печать Спецификаций. Документ: "+ДокОбъект+" Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(),"Информация");
	//крохин конец
	
	Возврат Таб;
КонецФункции
 
Функция РассчитатьСпецификацию(ТС,ВключатьНули=Ложь)
	
	ТипЧисло=ПолучитьОписаниеТиповЧисла(19,3);
	
	ОбязательныеКолонки=Новый Структура("Сумма,Всего",ТипЧисло,ТипЧисло);
	Для Каждого ОбязательнаяКолонка Из ОбязательныеКолонки Цикл
		Если ТС.Колонки.Найти(ОбязательнаяКолонка.Ключ)=Неопределено Тогда
			ТС.Колонки.Добавить(ОбязательнаяКолонка.Ключ,ОбязательнаяКолонка.Значение);		
		КонецЕсли;	
	КонецЦикла; 
	
	ТД=СформироватьТаблицуВывода(ТС);	
	
	МаксЧислоРазмеров=0;
	ТР=РасчитатьТаблицуРазмеров(ТС,МаксЧислоРазмеров);
	
	СтрокаСвертки="";
	
	СписокПолей=Новый Структура("Кол,КолКор,Сумма,Всего,Объем");
	
	Для Сч=0 По МаксЧислоРазмеров-1  Цикл
		Для Каждого Поле Из СписокПолей Цикл
			ТекИмяПоля=Поле.Ключ+"_"+Сч;
			ТД.Колонки.Добавить(ТекИмяПоля,ПолучитьОписаниеТиповЧисла(19,3));			
			
			СтрокаСвертки=СтрокаСвертки+?(ПустаяСтрока(СтрокаСвертки),"",",")+ТекИмяПоля;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Поле Из СписокПолей Цикл	
		ТекИмяПоля=Поле.Ключ+"_И";
		ТД.Колонки.Добавить(ТекИмяПоля,ПолучитьОписаниеТиповЧисла(19,3));
		СтрокаСвертки=СтрокаСвертки+?(ПустаяСтрока(СтрокаСвертки),"",",")+ТекИмяПоля;
	КонецЦикла;
	
	ВсегоСтрок=ТС.Количество();
	
	Для Каждого СтрокаТД Из ТД Цикл	
		Если СтрокаТД.Количество=0 И НЕ ВключатьНули Тогда Продолжить КонецЕсли;
		
		Номенклатура=СтрокаТД.Номенклатура;
		
		Если СтрокаТД.Размер.Пустая() Тогда
			Сообщить("Для товара: """+Номенклатура.Код+" "+Номенклатура+""" не указан размер !",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;		
		
		//Кухарь 13.09.15 начало
		//Для ЛН мы будем считать количество коробок из расчёта того количества штук в коробе, который в ТЧ Товары
		//ШтукВКоробке			=СтрокаТД.Модель.ШтукВКоробке;
		Если ДокОбъект.Метаданные().Имя="ЛистНабора"
			//++Данилова Е.В. 13.02.2026 SNL-139
			ИЛИ ДокОбъект.Метаданные().Имя="ЛистПереукладки" тогда  
			//--Данилова Е.В. 13.02.2026 
			ШтукВКоробке			=СтрокаТД.ШтВКоробе;
		Иначе
			ШтукВКоробке			=СтрокаТД.ШтукВКоробке;
		КонецЕсли;
		//Кухарь 13.09.15 конец			
		
		СтрокаТР=ТР.Найти(СтрокаТД.ГруппаРазмеров,"ГруппаРазмеров");		
		НомерРазмера=ИндексЗначенияВСписке(СтрокаТР.СписокРазмеров,СтрокаТД.Размер);
		
		СтрокаТД["Кол_"		+НомерРазмера]=СтрокаТД.Количество;		
		//Михайловский +++
		Если ДокОбъект.Метаданные().Имя="ЗаказПоставщику" Тогда 
			Если ЗначениеЗаполнено(СтрокаТД.ВсегоСКомпенсацией) Тогда
		
				СтрокаТД["Сумма_"	+НомерРазмера]=СтрокаТД.ВсегоСКомпенсацией;			
				СтрокаТД["Всего_"	+НомерРазмера]=СтрокаТД.ВсегоСКомпенсацией;
			Иначе
				СтрокаТД["Сумма_"	+НомерРазмера]=СтрокаТД.Сумма;			
				СтрокаТД["Всего_"	+НомерРазмера]=СтрокаТД.Всего;
			КонецЕсли;	
		Иначе
			СтрокаТД["Сумма_"	+НомерРазмера]=СтрокаТД.Сумма;			
			СтрокаТД["Всего_"	+НомерРазмера]=СтрокаТД.Всего;
		КонецЕсли;
		//Михайловский --
		ТекКолКор	=?(ШтукВКоробке=0,0,СтрокаТД.Количество/ШтукВКоробке);		
		ТекОбъем	=ТекКолКор*СтрокаТД.ОбъемКоробки;
		
		СтрокаТД["КолКор_"	+НомерРазмера]=ТекКолКор;			
		СтрокаТД["Объем_"	+НомерРазмера]=ТекОбъем;	
		
		СтрокаТД.Кол_И		=СтрокаТД.Кол_И		+СтрокаТД.Количество;		
		СтрокаТД.КолКор_И	=СтрокаТД.КолКор_И	+ТекКолКор;
		//Михайловский +++
		Если ДокОбъект.Метаданные().Имя="ЗаказПоставщику" Тогда
			Если ЗначениеЗаполнено(СтрокаТД.ВсегоСКомпенсацией) Тогда
				СтрокаТД.Сумма_И	=СтрокаТД.Сумма_И	+СтрокаТД.ВсегоСКомпенсацией;
				СтрокаТД.Всего_И	=СтрокаТД.Всего_И	+СтрокаТД.ВсегоСКомпенсацией;
			Иначе	
				СтрокаТД.Сумма_И	=СтрокаТД.Сумма_И	+СтрокаТД.Сумма;
				СтрокаТД.Всего_И	=СтрокаТД.Всего_И	+СтрокаТД.Всего;
			КонецЕсли;	
		Иначе
			СтрокаТД.Сумма_И	=СтрокаТД.Сумма_И	+СтрокаТД.Сумма;
			СтрокаТД.Всего_И	=СтрокаТД.Всего_И	+СтрокаТД.Всего;
		КонецЕсли;
		//Михайловский ---
		СтрокаТД.Объем_И	=СтрокаТД.Объем_И	+ТекОбъем;
		
		//Состояние("Обработка: "+Окр(100*ТД.Индекс(СтрокаТД)/ВсегоСтрок,2,1));
	КонецЦикла;	
	
	//Состояние("Суммирование итогов...");
	// Кухарь А.Ю.  10.11.2022 начало
	//  	ТД.Свернуть("ГруппаРазмеров,Брэнд,Коллекция2,Модель,Цвет",СтрокаСвертки);
	ТД.Свернуть("ГруппаРазмеров,Брэнд,Коллекция2,Модель,ДопПараметрРазмера,Цвет",СтрокаСвертки);
	// Кухарь А.Ю.  10.11.2022 конец
	
	
	ТМ=ТД.Скопировать();
	ТМ.Свернуть("ГруппаРазмеров,Брэнд,Коллекция2,Модель",СтрокаСвертки);
	
	ТБ=ТМ.Скопировать();
	ТБ.Свернуть("ГруппаРазмеров,Брэнд",СтрокаСвертки);	
	
	ТГР=ТМ.Скопировать();
	ТГР.Свернуть("ГруппаРазмеров",СтрокаСвертки);
	
	ТИ=ТГР.Скопировать();
	ТИ.Колонки.Добавить("ТМП");
	ТИ.Свернуть("ТМП",СтрокаСвертки);	
	ТИ.Колонки.Удалить(ТИ.Колонки.Количество()-1);
	
	ПрибавитьТаблицу(ТД,ТМ);
	ПрибавитьТаблицу(ТД,ТБ);
	ПрибавитьТаблицу(ТД,ТГР);
	ПрибавитьТаблицу(ТД,ТИ);
	
	// Кухарь А.Ю.  10.11.2022 начало
	// ТД.Сортировать("ГруппаРазмеров,Брэнд,Коллекция2,Модель,Цвет");
	ТД.Сортировать("ГруппаРазмеров,Брэнд,Коллекция2,Модель,Цвет,ДопПараметрРазмера"); 
	// Кухарь А.Ю.  10.11.2022 конец
	
	
	СВ=Новый Структура("ТР,ТД,МаксЧислоРазмеров",ТР,ТД,МаксЧислоРазмеров);
	
	Возврат СВ;		
КонецФункции

Процедура ВывестиТаблицуСпецификации(Таб,ТР,ТД,МаксЧислоРазмеров,Знач Валюта=Неопределено)
	Если ИмяСекцииКонца=Неопределено Тогда
		ИмяСекцииКонца="КонецБезЦен";			
	КонецЕсли; 
	
	Валюта=?(Валюта=Неопределено,Константы.ВалютаУпрУчета.Получить(),Валюта);
	
	Макет=ПолучитьМакет("Спецификация");
	//Кухарь 30.06.16 начало
	//Для цен из КЦН
	РекламационнаяТЧ=новый ТаблицаЗначений;
	если ДокОбъект.Метаданные().Имя="РасходнаяНакладная" тогда
		если ДокОбъект.Контрагент.Код="SSR-5284" тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	КорректировкаЦенВНакладнойТовары.Номенклатура,
			|	СУММА(КорректировкаЦенВНакладнойТовары.Количество) КАК Количество,
			|	СУММА(КорректировкаЦенВНакладнойТовары.НДС) КАК НДС,
			|	СУММА(КорректировкаЦенВНакладнойТовары.Всего) КАК Всего,
			|	СУММА(КорректировкаЦенВНакладнойТовары.Цена) КАК Цена,
			|	КорректировкаЦенВНакладнойТовары.Номенклатура.Родитель как Модель
			|ИЗ
			|	Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
			|ГДЕ
			|	КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
			|	И КорректировкаЦенВНакладнойТовары.Ссылка.Проведен
			|	И КорректировкаЦенВНакладнойТовары.Ссылка.ВидРекламации = &Вычерк
			|
			|СГРУППИРОВАТЬ ПО
			|	КорректировкаЦенВНакладнойТовары.Номенклатура,
			|	КорректировкаЦенВНакладнойТовары.Номенклатура.Родитель";		
			
			СписокНакладных = ДокОбъект.Ссылка;
			
			Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
			Запрос.УстановитьПараметр("Вычерк",перечисления.ВидыРекламаций.Вычерк);
			
			РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		КонецЕсли;
	КонецЕсли;
	//Кухарь 30.06.16 конец
	
	
	ЗаголовокСуммы	="Сумма,"+Валюта;
	
	ТД.Колонки.Добавить("ПредставлениеМодели");
	ТД.Колонки.Добавить("Цена");
	ТД.Колонки.Добавить("ШтукВКоробке");
	ТД.Колонки.Добавить("ШтукВКоробочке");
	ТД.Колонки.Добавить("НПП");
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	Если ДокОбъект<>Неопределено И ДокОбъект.Метаданные().Имя="ЗаказПоставщику" Тогда
		РазрядностьЦены=4; 
		//++Данилова Е.В. 25.09.2025 HELP-6934
	ИначеЕсли ДокОбъект<>Неопределено И ДокОбъект.Метаданные().Имя="КонтрактСПроизводителем" Тогда
		РазрядностьЦены=4;
		//--Данилова Е.В. 25.09.2025
	Иначе
		РазрядностьЦены=2;		
	КонецЕсли; 
	
	ПараметрыШапки=Новый Структура;
	ПараметрыШапки.Вставить("ЗаголовокСуммы","Сумма, "+Валюта);
	
	ОблПрочерк=Новый ТабличныйДокумент;
	
	ОблПрочерк.Вывести(Макет.ПолучитьОбласть("Черта|Начало"));
	Для Сч=1 По МаксЧислоРазмеров Цикл
		ОблПрочерк.Присоединить(Макет.ПолучитьОбласть("Черта|Размер"));	
	КонецЦикла; 
	ОблПрочерк.Присоединить(Макет.ПолучитьОбласть("Черта|"+ИмяСекцииКонца));
	
	НПП=0;
	Для Каждого СтрокаТР Из ТР Цикл		
		Уровень=1;
		
		СтрокаТД=ТД.Найти(СтрокаТР.ГруппаРазмеров,"ГруппаРазмеров");
		Если СтрокаТД=Неопределено Тогда Продолжить КонецЕсли; 
		
		ОблШапка=Новый ТабличныйДокумент;
		ОблШапкаНачало=Макет.ПолучитьОбласть("Шапка|Начало");
		
		ОблШапка.Вывести(ОблШапкаНачало);
		
		ТекСписокРазмеров	=СтрокаТР.СписокРазмеров;
		ТекЧислоРазмеров	=ТекСписокРазмеров.Количество();
		
		ЧислоПустыхРазмеров=МаксЧислоРазмеров-ТекЧислоРазмеров;
		
		Для Каждого Размер Из ТекСписокРазмеров Цикл
			ОблРазмер=Макет.ПолучитьОбласть("Шапка|Размер");			
			ОблРазмер.Параметры.Заполнить(Размер);
			
			ОблШапка.Присоединить(ОблРазмер,Уровень);
		КонецЦикла;
		
		Для Сч=1 по ЧислоПустыхРазмеров Цикл
			ОблРазмер=Макет.ПолучитьОбласть("Шапка|Размер");
			ОблРазмер.Параметры.Представление="---";
			
			ОблШапка.Присоединить(ОблРазмер,Уровень);		    
		КонецЦикла;
		
		ОблШапкаКонец=Макет.ПолучитьОбласть("Шапка|"+ИмяСекцииКонца);
		ОблШапкаКонец.Параметры.Заполнить(ПараметрыШапки);		
		
		ОблШапка.Присоединить(ОблШапкаКонец);
		ТекОбласть=ОблШапка.Область(1,ОблШапкаНачало.ШиринаТаблицы+1,1,ОблШапкаНачало.ШиринаТаблицы+МаксЧислоРазмеров);
		ТекОбласть.Объединить();
		ТекОбласть.Текст="РР: "+СтрокаТР.ГруппаРазмеров;		
		
		
		Таб.Вывести(ОблШапка,Уровень);
		
		
		Пока СтрокаТД<>Неопределено И СтрокаТД.ГруппаРазмеров=СтрокаТР.ГруппаРазмеров Цикл
			Если СтрокаТД.Брэнд=Неопределено Тогда
				ИмяСекции="ГруппаРазмеров";
				
				Уровень=1;
			ИначеЕсли СтрокаТД.Модель=Неопределено Тогда				
				ИмяСекции="Брэнд";
				
				Уровень=2;
			ИначеЕсли СтрокаТД.Цвет=Неопределено Тогда
				ИмяСекции="Модель";        
				
				Уровень=3;
				
				Модель		=СтрокаТД.Модель;
				//СтрокаТД.ПредставлениеМодели=СокрЛП(СокрЛП(Модель.КодПроизводителя)+" "+СокрЛП(Модель.Родитель)+" "+СокрЛП(Модель)+" "+?(Модель.Коллекция.Пустая(),""," ("+СокрЛП(Модель.Коллекция)+")"));
				СтрокаТД.ПредставлениеМодели=СокрЛП(СокрЛП(Модель.КодПроизводителя)+" "+СокрЛП(Модель.ПолноеНаименование()));
				//Кухарь 30.06.16 начало
				//Для цен из КЦН
				//СтрокаТД.Цена				=?(СтрокаТД.Кол_И=0,0,СтрокаТД.Всего_И/СтрокаТД.Кол_И);
				если РекламационнаяТЧ.Количество()= 0 тогда
					СтрокаТД.Цена				=?(СтрокаТД.Кол_И=0,0,СтрокаТД.Всего_И/СтрокаТД.Кол_И);
				иначе
					НайденнаяСтрока = РекламационнаяТЧ.Найти(СтрокаТД.Модель, "Модель");
					Если НайденнаяСтрока = Неопределено Тогда
						СообщитьИзМодуля("Товар не найден!");
					Иначе
						СтрокаТД.Цена				= - НайденнаяСтрока.Цена+?(СтрокаТД.Кол_И=0,0,СтрокаТД.Всего_И/СтрокаТД.Кол_И);	
						СтрокаТД.Всего_И=СтрокаТД.Цена*СтрокаТД.Кол_И;
					КонецЕсли;
					
				КонецЕсли;
				//Кухарь 30.06.16 конец
				
				СтрокаТД.ШтуквКоробке		=Модель.ШтукВКоробке;
				СтрокаТД.ШтукВКоробочке		=Модель.ШтукВКоробочке;
				
				НПП=НПП+1;
				
				СтрокаТД.НПП=НПП;
			Иначе
				Уровень=4;
				
				ИмяСекции="Цвет";				
			КонецЕсли;
			
			Если НЕ СписокПропускаемыхСекций.Свойство(ИмяСекции) Тогда				
				ОблСтрока=Новый ТабличныйДокумент;
				
				ОблНачало=Макет.ПолучитьОбласть(ИмяСекции+"|Начало");
				ОблНачало.Параметры.Заполнить(СтрокаТД);			
				
				ОблСтрока.Вывести(ОблНачало);
				
				Для Каждого Размер Из ТекСписокРазмеров Цикл			
					НомерРазмера=ИндексЗначенияВСписке(ТекСписокРазмеров,Размер.Значение);
					
					ОблРазмер=Макет.ПолучитьОбласть(ИмяСекции+"|Размер");
					ОблРазмер.Параметры.Количество=СтрокаТД["Кол_"+НомерРазмера];
					
					ОблСтрока.Присоединить(ОблРазмер,Уровень);
				КонецЦикла;
				
				ОблРазмер=Макет.ПолучитьОбласть(ИмяСекции+"|Размер");
				
				Для Сч=1 по ЧислоПустыхРазмеров Цикл					
					ОблСтрока.Присоединить(ОблРазмер,Уровень);		    
				КонецЦикла;
				
				ОблКонец=Макет.ПолучитьОбласть(ИмяСекции+"|"+ИмяСекцииКонца);
				ОблКонец.Параметры.Заполнить(СтрокаТД);
				
				Если  ИмяСекции="Модель" И ИмяСекцииКонца="Конец" Тогда
					ОблКонец.Области["Цена"].Формат="ЧДЦ="+РазрядностьЦены+"; ЧРГ=";				
				КонецЕсли; 
				
				ОблСтрока.Присоединить(ОблКонец);
				
				МассивСтрок=Новый Массив;
				МассивСтрок.Добавить(ОблСтрока);
				
				Если Не Таб.ПроверитьВывод(МассивСтрок) Тогда
					Таб.Область(Таб.ВысотаТаблицы,1,Таб.ВысотаТаблицы,Таб.ШиринаТаблицы).ГраницаСнизу=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
					//Таб.ВывестиГоризонтальныйРазделительСтраниц();					
					
					Таб.Вывести(ОблШапка);									
				КонецЕсли; 
				Таб.Вывести(ОблСтрока,Уровень);
			КонецЕсли;			
			
			СтрокаТД=ПолучитьСледующуюСтрокуТаблицы(ТД,СтрокаТД);
		КонецЦикла;
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Если ТД.Количество()=0 Тогда
		ТД.Добавить();	
	КонецЕсли; 
	
	СтрокаТД=ТД.Получить(0);
	
	//Кухарь 30.06.16 начало
	//Для цен из КЦН
	если РекламационнаяТЧ.Количество()>0 тогда
		СтрокаТД.Всего_И				= - РекламационнаяТЧ.Итог("Всего")+СтрокаТД.Всего_И;					
	КонецЕсли;
	//Кухарь 30.06.16 конец	
	
	ОблПодвалНачало=Макет.ПолучитьОбласть("Подвал|Начало");
	Если ИмяСекцииКонца="КонецБезЦен" Тогда
		ОблПодвалНачало.Параметры.СтрокаСуммы			="";
		ОблПодвалНачало.Параметры.СтрокаСуммыПрописью	="";
	Иначе
		ОблПодвалНачало.Параметры.СтрокаСуммы			="Всего на сумму: "+Формат(СтрокаТД.Всего_И,"ЧДЦ=2; ЧРГ=' '")+" "+Валюта;
		ОблПодвалНачало.Параметры.СтрокаСуммыПрописью	="Сумма прописью: "+ЧислоПрописью(СтрокаТД.Всего_И,,Валюта.ПараметрыПрописиНаРусском);
	КонецЕсли;
	
	ОблПодвалНачало.Параметры.ОбъемНакладной			="Объем: " +Формат(СтрокаТД.Объем_И,"ЧДЦ=3; ЧРГ=' '")+" м3";
	//Кухарь 13.04.16 начало
	//по просьбе Кудряшова
	//ОблПодвалНачало.Параметры.КоличествоЛН				=Формат(КоличествоЛН(),"ЧН=0");
	попытка
		если ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
			ОблПодвалНачало.Параметры.КоличествоЛН				=ДокОбъект.КоличествоКоробок;;
		иначе
			ОблПодвалНачало.Параметры.КоличествоЛН=Окр(СтрокаТД.КолКор_И,1);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	//Кухарь 13.04.16 конец
	
	
	Таб.Вывести(ОблПодвалНачало);
	
	Для Сч=1 по МаксЧислоРазмеров Цикл		
		Таб.Присоединить(Макет.ПолучитьОбласть("Подвал|Размер"));	    
	КонецЦикла;
	ОблПодвалКонец=Макет.ПолучитьОбласть("Подвал|"+ИмяСекцииКонца);
	ОблПодвалКонец.Параметры.Заполнить(СтрокаТД);
	//Кухарь 13.04.16 начало
	//По просьбе Кудряшова
	попытка
		если ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
			ОблПодвалКонец.Параметры.КолКор_И=ДокОбъект.КоличествоКоробок;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//Кухарь 13.04.16 конец	
	Таб.Присоединить(ОблПодвалКонец);	
КонецПроцедуры

/////////////// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ /////////////////////////////////////////////

Функция ПолучитьСледующуюСтрокуТаблицы(ТЗ,СтрокаТЗ)
	НомерСтроки=ТЗ.Индекс(СтрокаТЗ);
	
	Если НомерСтроки=ТЗ.Количество()-1 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ТЗ.Получить(НомерСтроки+1);	
	КонецЕсли;
КонецФункции // Получитьследующуюстрокутаблицы()

Функция ИндексЗначенияВСписке(Список,Значение)
	СтрокаСписка=Список.НайтиПоЗначению(Значение);	
	Если СтрокаСписка<>Неопределено Тогда
		Возврат Список.Индекс(СтрокаСписка);
	КонецЕсли; 
	Возврат -1;
КонецФункции // ИндексЗначенияВСписке()

Процедура ПрибавитьТаблицу(ТП,ТИ)
	Для Каждого СтрокаТИ Из ТИ Цикл
		СтрокаТП=ТП.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТП,СтрокаТИ);	
	КонецЦикла;
КонецПроцедуры 

Функция РасчитатьТаблицуРазмеров(ТС,МаксЧислоРазмеров,ВключатьНули=Ложь)
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	Количество 
	|ПОМЕСТИТЬ ТЧ_Накладной	
	|ИЗ 
	|	&ТЧ_Накладной КАК ТЧ_Накладной
	|ИНДЕКСИРОВАТЬ ПО 
	|	Номенклатура
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Спр_Номенклатура.Размер.Родитель 		КАК ГруппаРазмеров,
	|	Спр_Номенклатура.Размер					КАК Размер,
	|	Спр_Номенклатура.Размер.Наименование	КАК Размер_Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Спр_Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТЧ_Накладной
	|ПО
	|	Спр_Номенклатура.Ссылка=ТЧ_Накладной.Номенклатура
	|ГДЕ
	|	Родитель В (ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура.Родитель ИЗ ТЧ_Накладной)
	|	И (IsNULL(ТЧ_Накладной.Количество,0)>0 ИЛИ &ВключатьНули)
	|УПОРЯДОЧИТЬ ПО Размер.Наименование
	|ИТОГИ КОЛИЧЕСТВО(Различные Размер) ПО ГруппаРазмеров 	
	|";
	
	Запрос.УстановитьПараметр("ТЧ_Накладной",ТС);
	Запрос.УстановитьПараметр("ВключатьНули",ВключатьНули);
	
	ТР=Новый ТаблицаЗначений;  
	ТР.Колонки.Добавить("ГруппаРазмеров");	
	ТР.Колонки.Добавить("СписокРазмеров");	
	
	МаксЧислоРазмеров	= 0;
	ВыборкаПоГруппам	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ГруппаРазмеров");
	Пока ВыборкаПоГруппам.Следующий() Цикл
		СтрокаТР=ТР.Добавить();	
		
		СтрокаТР.ГруппаРазмеров=ВыборкаПоГруппам.ГруппаРазмеров;
		СтрокаТР.СписокРазмеров=Новый СписокЗначений;
		
		Выборка=ВыборкаПоГруппам.Выбрать();
		Пока Выборка.Следующий() Цикл			
			СтрокаТР.СписокРазмеров.Добавить(Выборка.Размер,Выборка.Размер_Наименование);	
		КонецЦикла;
		Если ВыборкаПоГруппам.Размер>МаксЧислоРазмеров Тогда
			МаксЧислоРазмеров=ВыборкаПоГруппам.Размер;					
		КонецЕсли; 
	КонецЦикла;
		
	Возврат ТР;
КонецФункции // ()

Функция СформироватьТаблицуВывода(ТС)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТС ИЗ &ТС КАК ТС 
	|;
	|ВЫБРАТЬ
	|	*,
	|	Номенклатура.Размер.Родитель 			КАК ГруппаРазмеров,
	|	Номенклатура.Размер						КАК Размер,
	|	Номенклатура.Цвет						КАК Цвет,
	// Кухарь А.Ю.  09.11.2022 начало
	|	Номенклатура.ДопПараметрРазмера			КАК ДопПараметрРазмера,	 
	// Кухарь А.Ю.  09.11.2022 конец
	
	|	Номенклатура.Родитель.Родитель.Родитель КАК Брэнд,
	|	Номенклатура.Родитель.Родитель			КАК Коллекция2,
	|	Номенклатура.Родитель					КАК Модель,
	|	
	|	Номенклатура.Коллекция					КАК Коллекция,
	|	Номенклатура.Родитель.ШтукВКоробке		КАК ШтукВКоробке,
	|	Номенклатура.Родитель.ОбъемКоробки		КАК ОбъемКоробки
	|	
	|ИЗ
	|	ТС
	|";
	Запрос.УстановитьПараметр("ТС",ТС);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
 
СписокПропускаемыхСекций=Новый Структура("ГруппаРазмеров,Брэнд")
